TexasInstruments/mspm0-sdk/examples/nortos/LP_MSPM0L2228/driverlib/empty_driverlib_src/ti/driverlib/dl_adc12.h
/**
 * @brief Allows SYSOSC to not run at base frequency when device is in STOP mode.
 *
 * @param[in] adc12    Pointer to the register overlay for the peripheral
 *
 *
 */
__STATIC_INLINE void DL_ADC12_disableForcingSYSOSCOnInStopMode(
    ADC12_Regs *adc12)
{
    DL_Common_updateReg(&adc12->ULLMEM.GPRCM.CLKCFG,
        (ADC12_CLKCFG_CCONSTOP_DISABLE | ADC12_CLKCFG_KEY_UNLOCK_W),
        (ADC12_CLKCFG_CCONSTOP_MASK | ADC12_CLKCFG_KEY_MASK));
}

/**
 * @brief Forces SYSOSC to run at base frequency when device is in STOP mode.
 *
 * @param[in] adc12    Pointer to the register overlay for the peripheral
 *
 *
 */
__STATIC_INLINE void DL_ADC12_forceSYSOSCOnInStopMode(ADC12_Regs *adc12)
{
    adc12->ULLMEM.GPRCM.CLKCFG |=
        (ADC12_CLKCFG_KEY_UNLOCK_W | ADC12_CLKCFG_CCONSTOP_ENABLE);
}

/**
 *  @brief      Enable ADC12 interrupt
 *
 *  @param[in]  adc12  Pointer to the register overlay for the peripheral
 *
 *  @param[in]  interruptMask  Bit mask of interrupts to check. Bitwise OR of
 *                             @ref DL_ADC12_INTERRUPTS.
 */
__STATIC_INLINE void DL_ADC12_enableInterrupt(
    ADC12_Regs *adc12, uint32_t interruptMask)
{
    adc12->ULLMEM.CPU_INT.IMASK |= (interruptMask);
}

/**
 *  @brief      Disable ADC12 interrupt
 *
 *  @param[in]  adc12  Pointer to the register overlay for the peripheral
 *
 *  @param[in]  interruptMask  Bit mask of interrupts to check. Bitwise OR of
 *                             @ref DL_ADC12_INTERRUPTS.
 *
 */
__STATIC_INLINE void DL_ADC12_disableInterrupt(
    ADC12_Regs *adc12, uint32_t interruptMask)
{
    adc12->ULLMEM.CPU_INT.IMASK &= ~(interruptMask);
}

/**
 *  @brief      Check which ADC12 interrupts are enabled
 *
 *  @param[in]  adc12          Pointer to the register overlay for the
 *                             peripheral
 *  @param[in]  interruptMask  Bit mask of interrupts to check. Bitwise OR of
 *                             @ref DL_ADC12_INTERRUPTS.
 *
 *  @return     Which of the requested ADC12 interrupts are enabled
 *
 *  @retval     Bitwise OR of @ref DL_ADC12_INTERRUPTS values
 */
__STATIC_INLINE uint32_t DL_ADC12_getEnabledInterrupts(
    ADC12_Regs *adc12, uint32_t interruptMask)
{
    return (adc12->ULLMEM.CPU_INT.IMASK & interruptMask);
}

/**
 *  @brief      Check interrupt flag of enabled ADC12 interrupt
 *
 *  Checks if the ADC12 interrupt that was previously enabled is pending.
 *
 *  @param[in]  adc12  Pointer to the register overlay for the peripheral
 *
 *  @param[in]  interruptMask  Bit mask of interrupts to check. Bitwise OR of
 *                             @ref DL_ADC12_INTERRUPTS.
 *
 *  @return     If the enabled ADC12 interrupt is pending
 *
 *  @sa         DL_ADC12_enableInterrupt
 */
__STATIC_INLINE uint32_t DL_ADC12_getEnabledInterruptStatus(
    ADC12_Regs *adc12, uint32_t interruptMask)
{
    return (adc12->ULLMEM.CPU_INT.MIS & interruptMask);
}

/**
 *  @brief      Check interrupt flag of any ADC12 interrupt
 *
 *  Checks if the ADC12 interrupt is pending. Interrupt does not have to
 *  be previously enabled.
 *
 *  @param[in]  adc12  Pointer to the register overlay for the peripheral
 *
 *  @param[in]  interruptMask  Bit mask of interrupts to check. Bitwise OR of
 *                             @ref DL_ADC12_INTERRUPTS.
 *
 *  @return     If the ADC12 interrupt is pending
 *
 */
__STATIC_INLINE uint32_t DL_ADC12_getRawInterruptStatus(
    ADC12_Regs *adc12, uint32_t interruptMask)
{
    return (adc12->ULLMEM.CPU_INT.RIS & interruptMask);
}

/**
 *  @brief      Get highest priority pending ADC12 interrupt
 *
 *  Checks if any of the ADC12 interrupts are pending. Interrupts do not have to
 *  be previously enabled.
 *
 *  @param[in]  adc12  Pointer to the register overlay for the peripheral
 *
 *  @return     The highest priority pending ADC12 interrupt
 *
 *  @retval     One of @ref DL_ADC12_IIDX
 */
__STATIC_INLINE DL_ADC12_IIDX DL_ADC12_getPendingInterrupt(ADC12_Regs *adc12)
{
    return ((DL_ADC12_IIDX) adc12->ULLMEM.CPU_INT.IIDX);
}

/**
 *  @brief      Clear pending ADC12 interrupt
 *
 *  @param[in]  adc12  Pointer to the register overlay for the peripheral
 *
 *  @param[in]  interruptMask  Bit mask of interrupts to check. Bitwise OR of
 *                             @ref DL_ADC12_INTERRUPTS.
 *
 */
__STATIC_INLINE void DL_ADC12_clearInterruptStatus(
    ADC12_Regs *adc12, uint32_t interruptMask)
{
    adc12->ULLMEM.CPU_INT.ICLR |= (interruptMask);
}

/**
 *  @brief Sets the event publisher channel id
 *
 *  @param[in]  adc12 Pointer to the register overlay for the
 *                      peripheral
 *  @param[in]  chanID  Channel ID number. Valid range 0-15. If ChanID == 0
 *                      publisher is disconnected.
 */
__STATIC_INLINE void DL_ADC12_setPublisherChanID(
    ADC12_Regs *adc12, uint8_t chanID)
{
    adc12->ULLMEM.FPUB_1 = (chanID & ADC12_FPUB_1_CHANID_MAXIMUM);
}

/**
 *  @brief Gets the event publisher channel id
 *
 *  @param[in]  adc12 Pointer to the register overlay for the
 *                      peripheral
 *
 *  @return     Event publisher channel ID
 *
 */
__STATIC_INLINE uint8_t DL_ADC12_getPublisherChanID(ADC12_Regs *adc12)
{
    return (uint8_t)(adc12->ULLMEM.FPUB_1 & ADC12_FPUB_1_CHANID_MAXIMUM);
}

/**
 *  @brief Sets the event subscriber channel id
 *
 *  @param[in]  adc12 Pointer to the register overlay for the
 *                      peripheral
 *  @param[in]  chanID  Channel ID number. Valid range 0-15. If ChanID == 0
 *                      subscriber is disconnected.
 */
__STATIC_INLINE void DL_ADC12_setSubscriberChanID(
    ADC12_Regs *adc12, uint8_t chanID)
{
    adc12->ULLMEM.FSUB_0 = (chanID & ADC12_FSUB_0_CHANID_MAXIMUM);
}

/**
 *  @brief Gets the event subscriber channel id
 *
 *  @param[in]  adc12 Pointer to the register overlay for the
 *                      peripheral
 *
 *  @return     Event subscriber channel ID
 *
 */
__STATIC_INLINE uint8_t DL_ADC12_getSubscriberChanID(ADC12_Regs *adc12)
{
    return (uint8_t)(adc12->ULLMEM.FSUB_0 & ADC12_FSUB_0_CHANID_MAXIMUM);
}

/**
 *  @brief      Enable ADC12 event
 *
 *  @param[in]  adc12          Pointer to the register overlay for the
 *                             peripheral
 *  @param[in]  eventMask      Bit mask of events to enable. Bitwise OR of
 *                             @ref DL_ADC12_EVENT.
 */
__STATIC_INLINE void DL_ADC12_enableEvent(
    ADC12_Regs *adc12, uint32_t eventMask)
{
    adc12->ULLMEM.GEN_EVENT.IMASK |= (eventMask);
}

/**
 *  @brief      Disable ADC12 event
 *
 *  @param[in]  adc12          Pointer to the register overlay for the
 *                             peripheral
 *  @param[in]  eventMask      Bit mask of events to enable. Bitwise OR of
 *                             @ref DL_ADC12_EVENT.
 */
__STATIC_INLINE void DL_ADC12_disableEvent(
    ADC12_Regs *adc12, uint32_t eventMask)
{
    adc12->ULLMEM.GEN_EVENT.IMASK &= ~(eventMask);
}

/**
 *  @brief      Check which adc12 dma triggers are enabled
 *
 *  @param[in]  adc12          Pointer to the register overlay for the
 *                             peripheral
 *  @param[in]  eventMask      Bit mask of events to check. Bitwise OR of
 *                             @ref DL_ADC12_EVENT.
 *
 *  @return     Which of the requested adc12 events are enabled
 *
 *  @retval     Bitwise OR of @ref DL_ADC12_EVENT values
 */
__STATIC_INLINE uint32_t DL_ADC12_getEnabledEvents(
    ADC12_Regs *adc12, uint32_t eventMask)
{
    return (adc12->ULLMEM.GEN_EVENT.IMASK & eventMask);
}

/**
 *  @brief      Check event flag of enabled adc12 event
 *
 *  Checks if any of the adc12 events that were previously enabled are
 *  pending.
 *
 *  @param[in]  adc12        Pointer to the register overlay for the
 *                             peripheral
 *  @param[in]  eventMask      Bit mask of events to check. Bitwise OR of
 *                             @ref DL_ADC12_EVENT.
 *
 *  @return     Which of the requested adc12 eventes are pending
 *
 *  @retval     Bitwise OR of @ref DL_ADC12_EVENT values
 *
 *  @sa         DL_ADC12_enableEvent
 */
__STATIC_INLINE uint32_t DL_ADC12_getEnabledEventStatus(
    ADC12_Regs *adc12, uint32_t eventMask)
{
    return (adc12->ULLMEM.GEN_EVENT.MIS & ~(eventMask));
}

/**
 *  @brief      Check event flag of any adc12 event
 *
 *  Checks if any events are pending. Events do not have to
 *  be previously enabled.
 *
 *  @param[in]  adc12          Pointer to the register overlay for the
 *                             peripheral
 *  @param[in]  eventMask      Bit mask of event to check. Bitwise OR of
 *                             @ref DL_ADC12_EVENT.
 *
 *  @return     Which of the requested adc12 event are pending
 *
 *  @retval     Bitwise OR of @ref DL_ADC12_EVENT values
 */
__STATIC_INLINE uint32_t DL_ADC12_getRawEventsStatus(
    ADC12_Regs *adc12, uint32_t eventMask)
{
    return (adc12->ULLMEM.GEN_EVENT.RIS & ~(eventMask));
}

/**
 *  @brief      Clear pending adc12 events
 *
 *  @param[in]  adc12          Pointer to the register overlay for the
 *                             peripheral
 *  @param[in]  eventMask      Bit mask of events to clear. Bitwise OR of
 *                             @ref DL_ADC12_EVENT.
 */
__STATIC_INLINE void DL_ADC12_clearEventsStatus(
    ADC12_Regs *adc12, uint32_t eventMask)
{
    adc12->ULLMEM.GEN_EVENT.ICLR |= (eventMask);
}

/**
 *  @brief      Enable ADC12 DMA triggers
 *
 *  @param[in]  adc12          Pointer to the register overlay for the
 *                             peripheral
 *  @param[in]  dmaMask      Bit mask of DMA triggers to enable. Bitwise OR of
 *                             @ref DL_ADC12_DMA.
 */
__STATIC_INLINE void DL_ADC12_enableDMATrigger(
    ADC12_Regs *adc12, uint32_t dmaMask)
{
    adc12->ULLMEM.DMA_TRIG.IMASK |= (dmaMask);
}

/**
 *  @brief      Disable ADC12 DMA triggers
 *
 *  @param[in]  adc12          Pointer to the register overlay for the
 *                             peripheral
 *  @param[in]  dmaMask        Bit mask of DMA triggers to enable. Bitwise OR of
 *                             @ref DL_ADC12_DMA.
 */
__STATIC_INLINE void DL_ADC12_disableDMATrigger(
    ADC12_Regs *adc12, uint32_t dmaMask)
{
    adc12->ULLMEM.DMA_TRIG.IMASK &= ~(dmaMask);
}

/**
 *  @brief      Check which adc12 DMA triggers are enabled
 *
 *  @param[in]  adc12          Pointer to the register overlay for the
 *                             peripheral
 *  @param[in]  dmaMask        Bit mask of DMA triggers to check. Bitwise OR of
 *                             @ref DL_ADC12_DMA.
 *
 *  @return     Which of the requested adc12 DMA triggers are enabled
 *
 *  @retval     Bitwise OR of @ref DL_ADC12_DMA values
 */
__STATIC_INLINE uint32_t DL_ADC12_getEnabledDMATrigger(
    ADC12_Regs *adc12, uint32_t dmaMask)
{
    return (adc12->ULLMEM.DMA_TRIG.IMASK & dmaMask);
}

/**
 *  @brief      Check event flag of enabled adc12 DMA triggers
 *
 *  Checks if any of the adc12 DMA triggers that were previously enabled are
 *  pending.
 *
 *  @param[in]  adc12          Pointer to the register overlay for the
 *                             peripheral
 *  @param[in]  dmaMask      Bit mask of DMA triggers to check. Bitwise OR of
 *                             @ref DL_ADC12_DMA.
 *
 *  @return     Which of the requested adc12 eventes are pending
 *
 *  @retval     Bitwise OR of @ref DL_ADC12_DMA values
 *
 *  @sa         DL_ADC12_enableDMATrigger
 */
__STATIC_INLINE uint32_t DL_ADC12_getEnabledDMATriggerStatus(
    ADC12_Regs *adc12, uint32_t dmaMask)
{
    return (adc12->ULLMEM.DMA_TRIG.MIS & ~(dmaMask));
}

/**
 *  @brief      Check DMA triggers flag of any adc12 dma trigger
 *
 *  Checks if any dma trigger are pending. DMA triggers do not have to
 *  be previously enabled.
 *
 *  @param[in]  adc12          Pointer to the register overlay for the
 *                             peripheral
 *  @param[in]  dmaMask        Bit mask of DMA triggers to check. Bitwise OR of
 *                             @ref DL_ADC12_DMA.
 *
 *  @return     Which of the requested adc12 dma triggers are pending
 *
 *  @retval     Bitwise OR of @ref DL_ADC12_DMA values
 */
__STATIC_INLINE uint32_t DL_ADC12_getRawDMATriggerStatus(
    ADC12_Regs *adc12, uint32_t dmaMask)
{
    return (adc12->ULLMEM.DMA_TRIG.RIS & ~(dmaMask));
}

/**
 *  @brief      Clear pending adc12 DMA triggers
 *
 *  @param[in]  adc12          Pointer to the register overlay for the
 *                             peripheral
 *  @param[in]  dmaMask        Bit mask of DMA triggers to clear. Bitwise OR of
 *                             @ref DL_ADC12_DMA.
 */
__STATIC_INLINE void DL_ADC12_clearDMATriggerStatus(
    ADC12_Regs *adc12, uint32_t dmaMask)
{
    adc12->ULLMEM.DMA_TRIG.ICLR |= (dmaMask);
}

#ifdef __MSPM0_HAS_ADC12_SH_CAP_DISCH__
/**
 *  @brief Enables sample and hold capacitor discharge
 *
 *  Sample and hold capacitor is discharged at end of conversion.
 *
 *  @param[in] adc12    Pointer to the register overlay for the peripheral
 */
__STATIC_INLINE void DL_ADC12_enableSAMPCAP(ADC12_Regs *adc12)
{
    adc12->ULLMEM.CTL2 |= (ADC12_CTL2_RSTSAMPCAPEN_ENABLE);
}

/**
 *  @brief Disables sample and hold capacitor discharge
 *
 *  Sample and hold capacitor is discharged at end of conversion. This incurs one additional clock cycle.
 *
 *  @param[in] adc12    Pointer to the register overlay for the peripheral
 *
 */
__STATIC_INLINE void DL_ADC12_disableSAMPCAP(ADC12_Regs *adc12)
{
    adc12->ULLMEM.CTL2 &= ~(ADC12_CTL2_RSTSAMPCAPEN_ENABLE);
}

/**
 *  @brief Checks if sample and hold capacitor discharge is enabled
 *
 *  @param[in] adc12    Pointer to the register overlay for the peripheral
 *
 *  @return If sample and hold capacitor discharge enabled
 *
 *  @retval  true  sample and hold capacitor discharge is enabled
 *  @retval  false sample and hold capacitor discharge is disabled
 *
 */
__STATIC_INLINE bool DL_ADC12_isSAMPCAPEnabled(ADC12_Regs *adc12)
{
    return ((adc12->ULLMEM.CTL2 & ADC12_CTL2_RSTSAMPCAPEN_MASK) ==
            ADC12_CTL2_RSTSAMPCAPEN_ENABLE);
}
#endif /* ADC HAS SAMPLE AND HOLD CAPACITOR DISCHARGE*/

#ifdef __MSPM0C110X_ADC_ERR_06__
/**
 *  @brief Get calibration ADC offset value
 *
 *  Workaround for errata on MSPM0C110x devices: ADC_ERR_06
 *
 *  Offset needs to be calibrated each time @ref DL_ADC12_configConversionMem
 *  is configured with a new voltage reference.
 *
 *  User needs to add calibrated offset to the result of @ref DL_ADC12_getMemResult
 *  to get correct ADC value.
 *
 *  @param[in] userRef  Reference voltage
 *
 *  @return Calibrated ADC offset value
 */
__STATIC_INLINE int16_t DL_ADC12_getADCOffsetCalibration(float userRef)
{
    float adcBuff = DL_FactoryRegion_getADCOffset() * (3.3 / userRef);
    return (int16_t)(round(adcBuff));
}
#endif

#ifdef __cplusplus
}
#endif

#endif /* __MSPM0_HAS_ADC12__ */

#endif /* ti_dl_dl_adc12__include */
/** @}*/
